# Програма, яка перевіряє, чи можна отримати позику на основі доходу і кредитного рейтингу користувача.

# Введення доходу і кредитного рейтингу користувача
income = float(input("Ваш дохід: "))
credit_score = int(input("Ваш кредитний рейтинг: "))

# Визначення умови для видачі позики
if income > 50000 and credit_score >= 700:
    loan_approval = "Одобрено"  # Відповідь "Одобрено" за складною умовою
else:
    loan_approval = "Відхилено"  # Відповідь "Відхилено" за складною умовою

# Виведення результату
print(f"Рішення по позиції: {loan_approval}")